<HTML><!-- #BeginTemplate "/Templates/EtaComp.dwt" -->
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF">
<DIV ALIGN="CENTER"> 
  <TABLE WIDTH="763" BORDER="0" BACKGROUND="Images/Band.gif">
    <TR>
      <TD WIDTH="114">&nbsp;</TD>
      <TD WIDTH="639"><B><FONT COLOR="#FFFFFF">EtaComp - Etalonnage de comparateurs</FONT></B></TD>
    </TR>
  </TABLE>
  <HR>
</DIV>
  
<!-- #BeginEditable "BODY" --> 
<H1 ALIGN="CENTER"><U><A NAME="Top"></A>Contr&ocirc;ler un comparateur</U></H1>
<H1 ALIGN="CENTER"><IMG SRC="Images/Courbe.gif" WIDTH="100" HEIGHT="71"></H1>
<P ALIGN="LEFT">Cette page d&eacute;crit la proc&eacute;dure &agrave; suivre pour 
  r&eacute;aliser le contr&ocirc;le d'un comparateur du d&eacute;but jusqu'&agrave; 
  la fin.<BR>
  Elle propose des liens vers les diff&eacute;rents chapitres de l'aide en ligne 
  r&eacute;pertori&eacute;s dans la page de sommaire.</P>
<H2 ALIGN="LEFT">Pr&eacute;paration du contr&ocirc;le:</H2>
<P ALIGN="LEFT">Au d&eacute;marrage, EtaComp affiche par d&eacute;faut le premier 
  panneau de visualisation nomm&eacute; &quot;<U><B>Caract&eacute;ristiques</B></U>&quot; 
  et ne contient aucune donn&eacute;e en m&eacute;moire.</P>
<P ALIGN="LEFT"> Si EtaComp contient d&eacute;j&agrave; des donn&eacute;es issues 
  d'un contr&ocirc;le pr&eacute;c&eacute;dent, s&eacute;lectionner le sous-menu 
  &quot;<U><B>Nouveau contr&ocirc;le</B></U>&quot; du menu &quot;<B><U>Fichier</U></B>&quot; 
  ou cliquer sur le bouton de la barre d'outils rep&eacute;r&eacute; par l'ic&ocirc;ne 
  <IMG SRC="Images/Btn_New.jpg" WIDTH="24" HEIGHT="24">. </P>
<P ALIGN="LEFT"> 
<DIV ALIGN="LEFT"> 
  <UL>
    <LI>Cette action permet de r&eacute;initialiser EtaComp et le place dans le 
      m&ecirc;me &eacute;tat que celui obtenu juste apr&egrave;s son d&eacute;marrage.</LI>
    <LI>Cette action efface <I><B>d&eacute;finitivement</B></I> toutes les donn&eacute;es 
      qui se trouvaient dans la m&eacute;moire de l'ordinateur et qui traitaient 
      du contr&ocirc;le pr&eacute;c&eacute;dent.</LI>
  </UL>
</DIV>
<P ALIGN="LEFT"></P>
<H2 ALIGN="LEFT">Saisie des informations:</H2>
<P ALIGN="LEFT">Un contr&ocirc;le est mat&eacute;rialis&eacute; par de nombreuses 
  mesures mais aussi par des informations sur la description du comparateur et 
  sur les conditions dans lesquelles le test s'est d&eacute;roul&eacute;.</P>
<P ALIGN="LEFT">Selon la logique de d&eacute;roulement des op&eacute;rations, 
  ces informations sont saisies avant le d&eacute;but des mesures mais EtaComp 
  autorise la modification des donn&eacute;es &eacute;nonc&eacute;es ci-dessous 
  <I> <B>&agrave; tout moment</B></I> durant le contr&ocirc;le d'un comparateur.</P>
<P ALIGN="LEFT">Les zones &quot;<B><U>Conditions de contr&ocirc;le</U></B>&quot; 
  et &quot;<U><B>Comparateur</B></U>&quot; permettent de saisir les champs qui 
  seront repris dans le proc&egrave;s verbal.</P>
<P ALIGN="CENTER"><IMG SRC="Images/LeftFrames.jpg" WIDTH="389" HEIGHT="340"> </P>
<P ALIGN="LEFT"> 
<DIV ALIGN="LEFT"> 
  <UL>
    <LI>La zone &quot;<U><B>Op&eacute;rateur</B></U>&quot; contient le nom de 
      l'op&eacute;rateur effectuant le contr&ocirc;le.</LI>
    <LI>La zone &quot;<U><B>Date du contr&ocirc;le</B></U>&quot; permet de s&eacute;lectionner 
      la date &agrave; laquelle le contr&ocirc;le a &eacute;t&eacute; effectu&eacute;e.<BR>
      Par d&eacute;faut, la date affich&eacute;e dans la zone de texte correspond 
      &agrave; la date du jour r&eacute;gl&eacute;e sur l'ordinateur.</LI>
    <LI>La zone &quot;<U><B>Temp&eacute;rature</B></U>&quot; doit contenir la 
      temp&eacute;rature mesur&eacute;e dans le local o&ugrave; le contr&ocirc;le 
      est effectu&eacute;.<BR>
      La zone de texte ne doit contenir que des valeurs num&eacute;riques (NB: 
      le symbole &quot;&deg;C&quot; est imprim&eacute; dans le proc&egrave;s verbal).</LI>
    <LI>La zone &quot;<U><B>Taux d'humidit&eacute;</B></U>&quot; permet de saisir 
      le pourcentage d'humidit&eacute; relative du local. Pour modifier la valeur, 
      utiliser les boutons situ&eacute;s &agrave; droite de la zone de texte <IMG SRC="Images/UpDown.jpg" WIDTH="32" HEIGHT="29"> 
      pour provoquer le d&eacute;filement.</LI>
    <LI>Le cadre&quot;<U><B>Comparateur</B></U>&quot; permet de saisir la descrition 
      du comparateur contr&ocirc;l&eacute;.</LI>
  </UL>
</DIV>
<P ALIGN="LEFT"></P>
<H2 ALIGN="LEFT">D&eacute;marrer le contr&ocirc;le d'un comparateur:</H2>
<P ALIGN="LEFT">EtaComp d&eacute;tecte automatiquement le d&eacute;but d'un contr&ocirc;le 
  gr&acirc;ce &agrave; l'interception de la premi&egrave;re mesure des s&eacute;ries 
  de mesures.</P>
<P ALIGN="LEFT">Lorsque le contr&ocirc;le d'un comparateur n'est pas encore commenc&eacute;, 
  la barre d'&eacute;tat situ&eacute;e en bas de la fen&ecirc;tre principale propose 
  l'aspect suivant:<BR>
  <IMG SRC="Images/StatusBarBeforeStart.jpg" WIDTH="712" HEIGHT="22"></P>
<P ALIGN="LEFT"> 
<DIV ALIGN="LEFT"> 
  <UL>
    <LI>La zone n&deg;1 affiche l'&eacute;tat de la liaison entre le comparateur 
      num&eacute;rique et le port s&eacute;rie de l'ordinateur.</LI>
    <LI>La zone n&deg;2 affiche l'&eacute;tat courant du contr&ocirc;le. Si la 
      zone indique &quot;Arr&ecirc;t&eacute;&quot;, c'est qu'il n'y a pas de contr&ocirc;le 
      en cours de r&eacute;alisation.</LI>
    <LI>La zone n&deg;5 affiche l'heure courante r&eacute;gl&eacute;e sur l'odinateur.</LI>
  </UL>
</DIV>
<P ALIGN="LEFT"></P>
<P ALIGN="LEFT"><B><U>Pour d&eacute;marrer un contr&ocirc;le:</U></B></P>
<P ALIGN="LEFT"> 
<DIV ALIGN="LEFT"> 
  <OL>
    <LI>S&eacute;lectionner le panneau de visualisation nomm&eacute; &quot;S&eacute;ries 
      de mesures&quot;.</LI>
    <LI>Positionner la course du comparateur &agrave; la premi&egrave;re valeur 
      de la s&eacute;rie (Normalement, cette valeur est le 0)</LI>
    <LI>Actionner le bouton poussoir du comparateur num&eacute;rique</LI>
  </OL>
</DIV>
<P ALIGN="LEFT">A la suite de la saisie de la premi&egrave;re mesure, la barre 
  d'&eacute;tat situ&eacute;e en bas de la fen&ecirc;tre principale propose l'aspect 
  suivant:<BR>
  <IMG SRC="Images/StatusBarAfterStart.jpg" WIDTH="713" HEIGHT="22"> </P>
<P ALIGN="LEFT"></P>
<P ALIGN="LEFT"> 
<DIV ALIGN="LEFT"> 
  <UL>
    <LI>La zone n&deg;2 affiche &quot;En cours&quot; pour indiquer qu'un contr&ocirc;le 
      de comparateur est en cours de r&eacute;alisation.</LI>
    <LI>La zone n&deg;3 affiche le sens de la course &agrave; respecter dans la 
      progression des valeurs de la s&eacute;rie.</LI>
    <LI>La zone n&deg;4 affiche des informations sur la situation courante du 
      contr&ocirc;le du comparateur</LI>
  </UL>
</DIV>
<P ALIGN="LEFT"></P>
<H2 ALIGN="LEFT">Effectuer les s&eacute;ries de mesures:</H2>
<P ALIGN="LEFT">Pour lire la page d'aide traitant de la phase des s&eacute;ries 
  de mesures, <A HREF="Serial.htm" TARGET="Right">cliquer ici</A>.</P>
<H2 ALIGN="LEFT">Terminer les s&eacute;ries de mesures:</H2>
<P ALIGN="LEFT">EtaComp d&eacute;tecte automatiquement la fin de la phase des 
  s&eacute;ries de mesures lorsque toutes les mesures de toutes les s&eacute;ries, 
  dans les deux sens de course, ont &eacute;t&eacute; effectu&eacute;es.</P>
<P ALIGN="LEFT">A cet instant, EtaComp affiche une bo&icirc;te de dialogue signalant 
  la fin de la phase.</P>
<H2 ALIGN="LEFT">Effectuer le relev&eacute; des &eacute;carts de fid&eacute;lit&eacute;:</H2>
<P ALIGN="LEFT">Pour lire la page d'aide traitant de la phase de relev&eacute; 
  des &eacute;carts de fid&eacute;lit&eacute;, <A HREF="Fidelity.htm" TARGET="Right">cliquer 
  ici</A>.</P>
<H2 ALIGN="LEFT">Terminer le relev&eacute; des &eacute;carts de fid&eacute;lit&eacute;:</H2>
<P ALIGN="LEFT">EtaComp d&eacute;tecte automatiquement la fin de la phase de relev&eacute; 
  des &eacute;carts de fid&eacute;lit&eacute; lorsque toutes les mesures des points 
  de fid&eacute;lit&eacute; ont &eacute;t&eacute; effectu&eacute;es.</P>
<P ALIGN="LEFT">A cet instant, EtaComp affiche une bo&icirc;te de dialogue signalant 
  la fin de la phase et propose un acc&egrave;s au panneau de finalisation</P>
<H2 ALIGN="LEFT">Finaliser un contr&ocirc;le:</H2>
<P ALIGN="LEFT">Pour lire la page d'aide traitant de la finalisation d'un contr&ocirc;le, 
  <A HREF="Final.htm" TARGET="Right">cliquer ici</A>.</P>
<H2 ALIGN="LEFT">Imprimer le proc&egrave;s verbal:</H2>
<P ALIGN="LEFT">Pour lire la page d'aide traitant de l'impression d'un proc&egrave;s 
  verbal, <A HREF="Print.htm" TARGET="Right">cliquer ici</A>.</P>
<H2 ALIGN="LEFT">Pr&eacute;parer EtaComp pour un nouveau contr&ocirc;le:</H2>
<P ALIGN="LEFT">Cette &eacute;tape correspond &agrave; la premi&egrave;re &eacute;tape 
  d&eacute;crite plus haut dans ce chapitre.<BR>
  <A HREF="#Top">Cliquer ici</A> pour remonter au d&eacute;but de la page d'aide.</P>
<!-- #EndEditable --> 
</BODY>
<!-- #EndTemplate --></HTML>
